import 'package:flutter/material.dart';
import 'package:flutter_screenutil/flutter_screenutil.dart';

class DeanWordSection extends StatelessWidget {
  const DeanWordSection({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      body: SingleChildScrollView(
        padding: const EdgeInsets.all(16),
        child: Column(
          crossAxisAlignment: CrossAxisAlignment.start,
          children: [
            Text(
              'كلمة العميد',
              style: TextStyle(
                fontSize: 18.sp,
                fontWeight: FontWeight.bold,
                color: Colors.blue.shade800,
              ),
            ),
            const SizedBox(height: 10),
            Text(
              """

يعتبر التعليـم أسـاسس النهضة وأساس الأمن القومى وأن عالمنا اليوم تجتاحه ثورة علمية وتكنولوجيـة هائلـــة وحتـــى نستطيـــع مواكبــة التطـورات السريعة والمتلاحقة في مختلف المجالات النوعية ،لذا تسعى كلية التربية النوعية –جامعة الأسكـندرية-بمــا تحمله من رســالة ساميـة وما تقوم بـه مــن أدوار متعددة ومهام متنوعة تعد العمود الفقــري في تطوير المجتمــع وتحقيـــق أهدافـــه حيث تسعــى الكليــة جاهدة إلى تحقيــق الجـــودة والتميـــز وتبـــوء مكــانة مرمـوقة علـى خريطة التعليم العالي بمناهجها الدراسيــة المختلفة علي إكســاب الطلاب المهــارات الفنيــة والإبــداعية فــي كـافة المجالات مستهـدفة إعداد معلم مؤهل تربوياً على أعلى مستوى من الكفــــاءة العلمــيــة ، وإكســابــه المهــــارات والمعــــارف المستحدثة مـــن خــلال التــطويـــر المستمر للبرامــج والخــطط الدراسيـــــــة التــي تقــــــدمها الكليـــــــة فـــي مختلــف التخــصصات النـــوعية علــــى مستـــــوى مرحلتـــــي البكالوريـــــوس والدراسات العليا لمواجهـــــة كافة التحديــــات الداخلية والخارجيــة اللازمــة لاقتحام ســوق العمل سواء فــي داخل الوطـــن أو خارجه، بالإضافة إلـــى تقديــــم الخدمــــات البحثيـــة والتدريبيـــــة والاستشاريـــــة المتخصصــة لمؤسســـــــات المجتمع المختلفة بما يسهم في تنمية المجتمع .


 وإني أدعو الله أن يوفقنا جميعاً في تحقيق رسالة الكلية وإعداد معلمين مؤمنين برسالتهم قادرين على الإبداع وتشكيل عالم  لتعليم والتعلم والمنافسة في سوق العمل.خالص دعواتي أن تصل كليتنا إلى مكانها اللائق ومكانتها المستحقة بفضل ما يقدمه الجميع من جهد كما أتمني أن يكون ما نقدمه من معلومات فى هذا الموقع من أنشطة ومؤتمرات وندوات وورش عمل، وكذلك الانجازات التي تحققها الكلية والتي يتم تحديثها بصفة مستمرة يحقق ما تريدون معرفته ونسعى دائما إلي المزيد من التطوير المستمر للموقع ليلبي أحتياجاتكم ورغباتكم بما يحقق النفع العام .

مع خالص شكري وتقديري لكل من ساهم بجهده في إعداد هذا الموقع، وأدعو الله سبحانه وتعالي أن يوفقنا جميعا لخدمة ورفعة وتنمية وطننا الغالي ؛

""",
              style: TextStyle(fontSize: 14.sp),
              textAlign: TextAlign.justify,
            ),
            Text(
              '''أ.د/ نجدة إبراهيم ماضي

عميد كلية التربية النوعية بجامعة الاسكندرية
''',
              style: TextStyle(
                fontSize: 18.sp,
                fontWeight: FontWeight.bold,
                color: Colors.blue.shade800,
              ),
            ),
          ],
        ),
      ),
    );
  }
}
