import 'package:flutter/material.dart';
import 'package:flutter_screenutil/flutter_screenutil.dart';

class HistorySection extends StatelessWidget {
  const HistorySection({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      body: SingleChildScrollView(
        padding: const EdgeInsets.all(16),
        child: Column(
          crossAxisAlignment: CrossAxisAlignment.start,
          children: [
            Text(
              'نبذة تاريخية	',
              style: TextStyle(
                fontSize: 18.sp,
                fontWeight: FontWeight.bold,
                color: Colors.blue.shade800,
              ),
            ),
            const SizedBox(height: 10),
            Text(
              """
	
عانت مدارس وزارة التربية و التعليم خلال سنوات طويلة عجزا واضحا في مدارس المواد التطبيقية (الاقتصاد المنزلي ، التربية الموسيقية ، التربية الفنية) حيث كان هناك أقلية من الكليات المتخصصة التي تمد الوزارة باحتياجاتها في تلك التخصصات مثل كلية الاقتصاد المنزلي بالقاهرة و الفنون الجميلة بالإسكندرية ، غير أن معظم الخريجين في تلك الكليات كانوا يتجهون إلي مجالات أخري بعيدا عن مهنة التدريس فيما ندر ، فضلا عن أن دور المعلمين و المعلمات كانت تهتم أولا بدراسة المواد التطبيقية فكانت تضاف المواد التربوية إلي الدارسين في السنتين الأخيرتين من الدراسة ، و من ثم أفتقد المجتمع المدرس المؤهل تربويا لتدريس هذه المواد.

لذا اتجه التفكير في إنشاء الكليات النوعية التي تعمل على تأهيل هذا المعلم الذي يمكن الاعتماد علية في تنمية شخصية الطلاب من خلال البرامج التربوية في الفنون و الموسيقي و الاقتصاد المنزلي ، لأداء هذا الدور الحيوي إعدادا سليما.

و كانت كليات المعلمين النوعية بالإسكندرية إحدى أربع كليات تم اعتماد إنشائها في سبتمبر عام 1988 بالعباسية للمعلمات ، و دار السلام للمعلمين و كليتين بالإسكندرية بمعلمات الرمل ، غير أن ظروف الإنشاء و تأخر الدراسة عام الإنشاء أدي إلي افتتاح كلية واحدة بالإسكندرية و كان الاسم أول الأمر لا يتفق مع المضمون العلمي الدقيق و الهدف التربوي الذي أنشأت الكلية من أجلة ، ثم سميت الكلية بكلية التربية النوعية بالإسكندرية لتكون إحدى الكليات الرائدة التي انتقلت بخطوات ثابتة واعية لتخريج المعلم التربوي المؤهل فنيا في مجالات الاقتصاد المنزلي و الفنون و الموسيقي.

و لمسايرة الاتجاهات التربوية العالمية المعاصرة في إعداد المعلم أتخذ المجلس الأعلى للكليات النوعية و رياض الأطفال لاستحداث نظام الفصلين الدراسيين الذي يحقق استمرارية العملية التعليمية و اندماج الطلاب كاملا في الدراسة و الأنشطة طوال العام الدراسي و بناء على ذلك فقد تم تطبيق هذا النظام اعتبـارا من العام الدراسي 1995/1996  طبقا للقـــرار الوزاري رقم   1556 بتاريخ 26/10/1995 ، و تم توزيع الخطة الدراسية على هذا الأساس بجميع الشعب الدراسية بالكلية.""",
              style: TextStyle(fontSize: 14.sp),
              textAlign: TextAlign.justify,
            ),
          ],
        ),
      ),
    );
  }
}
